class Constant {
  // 翻转速度
  static const Duration FLIP_SPEED = Duration(milliseconds: 100);
  // 每次持续时间
  static const Duration SHAKING_DURATION = Duration(seconds: 3);
  // 爻
  static const YAO_NAME = ['老阳', '少阴', '少阳', '老阴'];
  // 爻的表示，eg 初九、六二，根据阴阳替换
  static const YAO_ORDER = ['初#', '#二', '#三', '#四', '#五', '上#'];
  // 八卦
  static const GUA_DICT = ['坤', '震', '坎', '兑', '艮', '离', '巽', '乾'];
  // 卦象 eg. 乾为天
  static const GUA_IMAGE = ['地', '雷', '水', '泽', '山', '火', '风', '天'];
  // 卦的索引
  static const List<List<int>> GUA_MAP = [
    [2, 24, 7, 19, 15, 36, 46, 11],
    [16, 51, 40, 54, 62, 55, 32, 34],
    [8, 3, 29, 60, 39, 63, 48, 5],
    [45, 17, 47, 58, 31, 49, 28, 43],
    [23, 27, 4, 41, 52, 22, 18, 26],
    [35, 21, 64, 38, 56, 30, 50, 14],
    [20, 42, 59, 61, 53, 37, 57, 9],
    [12, 25, 6, 10, 33, 13, 44, 1]
  ];
  // 64 卦名
  static const List<String> GUA_NAME = [
    '乾',
    '坤',
    '屯',
    '蒙',
    '需',
    '讼',
    '师',
    '比',
    '小畜',
    '履',
    '泰',
    '否',
    '同人',
    '大有',
    '谦',
    '豫',
    '随',
    '蛊',
    '临',
    '观',
    '噬嗑',
    '贲',
    '剥',
    '复',
    '无妄',
    '大畜',
    '颐',
    '大过',
    '坎',
    '离',
    '咸',
    '恒',
    '遁',
    '大壮',
    '晋',
    '明夷',
    '家人',
    '睽',
    '蹇',
    '解',
    '损',
    '益',
    '夬',
    '姤',
    '萃',
    '升',
    '困',
    '井',
    '革',
    '鼎',
    '震',
    '艮',
    '渐',
    '归妹',
    '丰',
    '旅',
    '巽',
    '兑',
    '涣',
    '节',
    '中孚',
    '小过',
    '既济',
    '未济'
  ];
}
